#!/usr/bin/env bash

###############################################################################
# HomeServer
#
# Descrição:
# Funções para obtenção de informações do sistema operacional.
###############################################################################

#
# ---------------------------------------------------------------------------
# Hostname
# ---------------------------------------------------------------------------
#

_system_read_hostname() {
    hostname
}

system_get_hostname() {
    _system_read_hostname
}